docs/server.reveal.html
<!DOCTYPE html><html lang="es"><head><meta charset="utf-8"><title>Servidor de juego en red</title><meta name="author" content="Carlos León"><link rel="stylesheet" href="tooling.reveal.e38fa0d8.css"><link rel="stylesheet" href="tooling.reveal.a866bf8d.css" id="theme"><link rel="stylesheet" href="tooling.reveal.c1a625de.css"><link rel="stylesheet" href="tooling.reveal.fdb16a0d.css"></head><body> <div class="reveal"> <div class="slides"> <section id="sec-title-slide"> <h1 class="title">Servidor de juego en red</h1><h2 class="author">Carlos León</h2><h2 class="email"><a href="mailto:cleon@ucm.es">cleon@ucm.es</a></h2> </section> <section> <section id="slide-implementación-de-un-servidor-para-juegos-en-navegador"> <h2 id="implementación-de-un-servidor-para-juegos-en-navegador">Implementación de un servidor para juegos en navegador</h2> </section> <section> <p> El servidor será un programa en <code>node.js</code> que estará ejecutándose siempre </p> <p> No podrá estar alojado en GitHub, ya que no es una página web, sino un programa </p> </section> <section> <p> Podemos alojarlo en un ordenador nuestro, o en algún servicio de alojamiento (<a href="https://www.heroku.com/">Heroku</a>, <a href="https://www.openshift.com/">Red Hat OpenShift</a>) </p> </section> <section> <p> Para probar en local, lo ejecutamos en nuestro ordenador </p> <p> Podemos detener el servidor <b>con <code>Ctrl-C</code></b> </p> </section> <section> <p> En la Facultad podemos ver la IP con: </p> <pre class="example" id="orgbfeadfa">
ipconfig /all
</pre> <p> Será <b>147.96.xxx.xxx</b> </p> </section> </section> <section> <section id="slide-websockets"> <h2 id="websockets">WebSockets</h2> </section> <section> <p> <i>WebSockets</i> es un estándar de comunicación sobre <i>TCP</i> para navegadores </p> <p> Aunque puede ser usado por cualquier programa </p> </section> <section> <p> No es la única manera de comunicarse con un navegador, hay varias </p> </section> <section> <p> Dejaremos que una librería decida cuál es la mejor manera de comunicarse&#x2026; </p> </section> </section> <section> <section id="slide-socket.io"> <h2 id="socket.io"><code>socket.io</code></h2> </section> <section> <p> Usaremos <code>socket.io</code>, una librería de JavaScript para red </p> </section> <section> <p> Tanto el servidor como el cliente estarán accesibles a través de <code>socket.io</code>, con lo que no usaremos GitHub para servir la página </p> </section> <section> </section> <section id="slide-servidor-http"> <h3 id="servidor-http">Servidor HTTP</h3> <p> Lo primero que tendremos es un servidor HTTP que nos habilitará el protocolo básico </p> </section> <section> </section> <section id="slide-servidor-de-aplicaciones"> <h3 id="servidor-de-aplicaciones">Servidor de aplicaciones</h3> <p> También crearemos un servidor de aplicaciones web </p> <p> Esto no es más que una capa por encima de HTTP para gestionar mejor las URLs y lo que devuelven </p> </section> <section> </section> <section id="slide-servidor-de-conexión"> <h3 id="servidor-de-conexión">Servidor de conexión</h3> <p> Por último, tendremos el servidor del juego en sí </p> </section> <section> <p> Pero todo esto son sólo 3 líneas de código =) </p> </section> </section> <section> <section id="slide-desplegando-el-servidor"> <h2 id="desplegando-el-servidor">Desplegando el servidor</h2> </section> <section> <p> Tenemos que usar <code>node.js</code>, y su gestor de paquetes (<code>npm</code>), que se encargará de instalar todo </p> </section> <section> <p> Los proyectos (la información de paquetes y versiones) se guarda en <code>package.json</code>, que debería estar en el repositorio de versiones </p> </section> <section> <p> <code>npm</code> gestiona <code>package.json</code> por nosotros </p> </section> <section> </section> <section id="slide-iniciar-el-proyecto"> <h3 id="iniciar-el-proyecto">Iniciar el proyecto</h3> <div class="org-src-container"> <pre><code class="sh">npm init # Pregunta datos y crea `package.json`
npm install --save express socket.io # Instala las librerías necesarias y lo añade a `package.json`
</code></pre> </div> <p> <code>npm install</code> instala el paquete, y <code>--save</code> hace que se guarde la información en <code>package.json</code> </p> </section> <section> <p> En <code>node.js</code> importamos los módulos/paquetes con <code>require</code> en vez de hacerlo con <code>import</code> </p> </section> <section> <p> El código de nuestro servidor estará en un archivo JavaScript para <code>node.js</code> (<b>no para el navegador</b>) </p> </section> <section> <p> En ese archivo (<code>server.js</code>, por ejemplo), primero tenemos que usar algunos módulos que hemos instalado con <code>npm</code>: </p> <div class="org-src-container"> <pre><code class="js">const app = require('express')(); // servidor de aplicaciones
const http = require('http').createServer(app); // servidor HTTP
const io = require('socket.io')(http); // Importamos `socket.io`
</code></pre> </div> </section> <section> <p> Después, creamos un par de variables (esto es opcional): </p> <div class="org-src-container"> <pre><code class="js">const port = 3000; // El puerto
var clients = [];
</code></pre> </div> </section> <section> <p> Luego le decimos al servidor que cuando accedan por HTTP, les devuelva la página web del cliente: </p> <div class="org-src-container"> <pre><code class="js">app.get('/', function(req, res){
  res.sendFile(__dirname + '/client.html');
});
</code></pre> </div> <p> Así, al acceder a la IP/URL, veremos directamente el juego </p> </section> <section> <p> Con sólo este código, ya podemos centrarnos en la lógica del servidor de juego </p> </section> <section> </section> <section id="slide-responder-a-mensajes"> <h3 id="responder-a-mensajes">Responder a mensajes</h3> <p> <code>socket.io</code> tiene, en el objeto <code>io</code>, un método para reaccionar antes solicitudes de conexión de un cliente: </p> <div class="org-src-container"> <pre><code class="js">io.on('connection', socket =&gt; {
  console.log('a user connected');
  clients.push(socket); // metemos el socket en el array
</code></pre> </div> </section> <section> <p> <i>Dentro del callback de <code>on()</code></i>, tenemos ahora la variable <code>socket</code> que nos ha llegado como parámetro </p> </section> <section> <p> Con la variable <code>socket</code> vamos a reaccionar a diferentes eventos </p> </section> <section> <p> Por ejemplo, cuando un cliente se desconecta: </p> <div class="org-src-container"> <pre><code class="js">  socket.on('disconnect', () =&gt; {
    console.log('a user disconnected');
    clients.splice(clients.indexOf(socket), 1); // lo sacamos del array
  });
</code></pre> </div> </section> <section> <p> O cuando nos envían el mensaje <code>'precios'</code>, con los datos en el objeto <code>mensaje</code> </p> <div class="org-src-container"> <pre><code class="js">  socket.on('precios', mensaje =&gt; {
    let lista = 
        mensaje === 'armas' ?
           {espada: 400, escudo: 200} :
           {naranja: 10, limon: 15};
        
    // para enviar algo, usamos `emit`
    // que tiene un nombre de mensaje,
    // y un objeto
    socket.emit('respuesta', lista);
  });
});
</code></pre> </div> </section> <section> <p> Como vemos, para enviar mensajes por un <code>socket</code> necesitamos el método <code>emit()</code>, con 2 parámetros: </p> <ul> <li>Un <code>string</code> con el tipo de mensaje</li> <li>Un objeto JavaScript con todo lo que queramos mandar</li> </ul> </section> <section> </section> <section id="slide-arrancando-el-servidor-realmente"> <h3 id="arrancando-el-servidor-realmente">Arrancando el servidor realmente</h3> <p> Ahora, para cerrar el archivo, creamos el servidor web que estará escuchando en el puerto que hayamos elegido: </p> <div class="org-src-container"> <pre><code class="js">// Creación del servidor en sí (por HTTP)
http.listen(port, () =&gt; {
  console.log('Servidor escuchando en el puerto', port);
});
</code></pre> </div> </section> <section> </section> <section id="slide-ejecutar-el-servidor"> <h3 id="ejecutar-el-servidor">Ejecutar el servidor</h3> <p> Y, dentro de la carpeta inicializada con el proyecto y el archivo <code>package.json</code>: </p> <div class="org-src-container"> <pre><code class="sh">node server.js
</code></pre> </div> </section> <section> </section> <section id="slide-servir-contenido-extra"> <h3 id="servir-contenido-extra">Servir contenido extra</h3> <p> Para servir archivos que estén en una carpeta (assets, hojas de estilo): <code>app.use(express.static(__dirname + '/public'))</code> </p> </section> </section> </div> </div> <script src="tooling.reveal.ffb33b1a.js"></script> <script src="tooling.reveal.f05d24be.js"></script> <script src="tooling.reveal.1feea775.js"></script> <script src="tooling.reveal.d2982244.js"></script> <script>Reveal.initialize({controls:!0,progress:!0,history:!0,center:!0,slideNumber:"c",rollingLinks:!1,keyboard:!0,mouseWheel:!1,fragmentInURL:!1,hashOneBasedIndex:!1,pdfSeparateFragments:!0,overview:!0,transition:"none",transitionSpeed:"default",plugins:[RevealSearch,RevealHighlight,RevealZoom],dependencies:[]});</script> </body></html>